heatTransfer/chtMultiRegionSimpleFoam/doublePipeHeatExchangerLowRe/0/fluidB/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluidB";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 -0.035 );

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 -0.035);
    }
    outlet
    {
        type            inletOutlet;
		inletValue      $internalField;
        value           $internalField;
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    fluidB_to_solid
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
