heatTransfer/chtMultiRegionSimpleFoam/doublePipeHeatExchangerLowRe/0/fluidB/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluidB";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 293.4;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 288.15;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;	
    }
    walls
    {
        type            zeroGradient;
        value           $internalField;
    }
    fluidB_to_solid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
}


// ************************************************************************* //
