heatTransfer/chtMultiRegionSimpleFoam/doublePipeHeatExchangerLowRe/system/fluidA/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default     steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)	    cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    div(phi,U) 	    bounded Gauss linearUpwind unlimited;//bounded Gauss GammaV 0.2;//Gauss upwind;
    div(phi,e)      bounded Gauss linear;    
    div(phi,K)      bounded Gauss linear;
    div(phi,Ekp)    bounded Gauss linear;    
    div(phi,h)      bounded Gauss linear;
    div(phi,omega)  bounded Gauss linearUpwind limited;
    div(phi,epsilon)  bounded Gauss linearUpwind limited;
    div(phi,k)      bounded Gauss linearUpwind limited;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 0.333;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 0.333;
}

fluxRequired
{
    default         yes;
}

wallDist
{
  method meshWave;
}

// ************************************************************************* //
