heatTransfer/chtMultiRegionSimpleFoam/doublePipeHeatExchangerLowRe/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(h|e)"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-8;
        relTol           0.1;
	minIter		 1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    equations
    {
        h               1.0; // nicht relaxieren, dauert sonst ewig in der Konvergenz
    }
}

// ************************************************************************* //
