heatTransfer/chtMultiRegionSimpleFoam/doublePipeHeatExchangerLowRe/system/fluidB/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    /*limitT
    {
        type            limitTemperature;
        active          yes;

        limitTemperatureCoeffs
        {
            selectionMode   all;
            min             270;
            max             320;
            Tmin             270;
            Tmax             320;	    
        }
    }*/

//************************************************************************ //
