heatTransfer/chtMultiRegionSimpleFoam/doublePipeHeatExchangerLowRe/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Setup case
./Allrun.pre


runApplication `getApplication`


#------------------------------------------------------------------------------
